In [1]:
import pandas as pd

In [18]:
df = pd.DataFrame({'year': [2015, 2016],
                  'month': [2, 3],
                  'day': [28, 5]})

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    2 non-null      int64
 1   month   2 non-null      int64
 2   day     2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [20]:
pd.to_datetime(df)

0   2015-02-28
1   2016-03-05
dtype: datetime64[ns]

In [21]:
df['date'] = pd.to_datetime(df)

In [22]:
df

   year  month  day       date
0  2015      2   28 2015-02-28
1  2016      3    5 2016-03-05

In [23]:
df.date.dt.year

0    2015
1    2016
Name: date, dtype: int64

In [24]:
df.date.dt.month

0    2
1    3
Name: date, dtype: int64

In [25]:
df.date.dt.day

0    28
1     5
Name: date, dtype: int64

In [26]:
import datetime

In [27]:
df.date

0   2015-02-28
1   2016-03-05
Name: date, dtype: datetime64[ns]

In [32]:
df['date_minus-7'] = df.date+(datetime.timedelta(days=-7))

In [33]:
df

   year  month  day       date date_minus-7
0  2015      2   28 2015-02-28   2015-02-21
1  2016      3    5 2016-03-05   2016-02-27